I think this item in the trace log points more directly to the cause of this oddity:

```
2022-07-07T13:10:47.261+0100 [WARN]  Provider "registry.terraform.io/hashicorp/google" produced an invalid plan for google_dns_record_set.cdn_dns_txt_record_firebase, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .rrdatas: planned value cty.NullVal(cty.List(cty.String)) does not match config value cty.ListVal([]cty.Value{cty.StringVal("\"v=spf1 include:_spf.firebasemail.com ~all\""), cty.UnknownVal(cty.String)})
```

"because it is using the legacy plugin SDK", Terraform Core is reporting the problem as an inconsistency between the intermediate plan and the final plan, rather than between the configuration and the plan, but this warning shows that it's really the initial planning step that misbehaved here.

I wonder if this is a quirk of SDKv2's `DiffSuppressFunc` feature. We can see in the warning above that Terraform Core sees this value as a list containing one known element and one unknown element. I believe SDKv2 cannot support a partially-unknown list in this way, and so would typically simplify it as a wholly-unknown list.

However, by the time `DiffSuppressFunc` sees that value it has been serialized into the "flatmap" form that the SDK uses for the plan and state, so I think it would be shaped like this:

```go
map[string]string{
    // (...all of the other flatmap key/value pairs)
    "rrdatas.#": "74D93920-ED26-11E3-AC10-0800200C9A66",
}
```

That weird UUID above is the placeholder value that the SDK uses internally to represent "unknown value", defined internally as [`hcl2shim.UnknownVariableValue`](https://pkg.go.dev/github.com/hashicorp/terraform-plugin-sdk/internal/configs/hcl2shim#UnknownVariableValue).

If I'm right in all of this guesswork (which is far from guaranteed! :grinning:) then I think it _may_ be possible to address this by adding yet another exception to this early return branch at the top of the `DiffSuppressFunc`:

https://github.com/hashicorp/terraform-provider-google/blob/e31d0d84ad28cba926c43c9736342339b6620345/google/resource_dns_record_set.go#L16-L18

Something like this:

```go
 if k == "rrdatas.#" && (new == "0" || new == "74D93920-ED26-11E3-AC10-0800200C9A66") && old != new { 
 	return false 
 }
```

I don't know if the SDK exposes that `UnknownVariableValue` constant somewhere you can import from your provider -- the constant I linked to above is in an internal package and so not directly importable. If there _is_ a constant for it somewhere then I'd suggest using that rather than the raw value, to make this easier to understand in future. I see that [the Azure provider has its own copy of this constant](https://cs.github.com/hashicorp/terraform-provider-azuread/blob/7d917e39860c7200392e175f9e20ccd2ba1a4f98/internal/tf/pluginsdk.go?q=%2274D93920-ED26-11E3-AC10-0800200C9A66%22#L6) for a similar purpose, which is perhaps evidence that it's not exported anywhere reusable. :confounded: 

My intent with the above is that if the new value for this argument is unknown then it should _not_ "suppress the diff", and should therefore show the value as "known after apply" during the initial plan, rather than as null (omitted):

```
  # google_dns_record_set.cdn_dns_txt_record_firebase will be created
  + resource "google_dns_record_set" "cdn_dns_txt_record_firebase" {
      + id           = (known after apply)
      + managed_zone = "bob.com."
      + name         = "www.bob.com"
      + project      = (known after apply)
      + rrdatas      = (known after apply)
      + ttl          = 300
      + type         = "TXT"
    }
```

Then during the apply phase, Terraform Core will ask the provider for its final plan with `google_project.my_project.id` set to a known value, and so the provider will still get the opportunity to run its `DiffSuppressFunc` logic against that known value. Because the initial plan included an unknown value, Terraform will not _rule_ that the final "suppressed diff" is an "inconsistent final plan" (an unknown value can take on any value of the expected type) and so the apply step should complete as expected.

I want to be explicit that I've been working entirely in thought experiments here and have not actually tested any of this, because I don't have a GCP account to test with. If any of my assumptions don't hold in practice then the solution I proposed above probably won't actually fix it, but it seems worth a try!
